package qaqa;

import java.util.ArrayList;
import java.util.List;

public class Namer {
    private final String[] first_names_top_ten = new String[] {
        "조", "강", "윤", "장", "임"
    };

    private final String[] first_names_one_percent = new String[] {
        "한", "오", "서", "신", "권", "황", "안", "송", "전", "홍", "유", "고", "문", "양", "손", "배", "조", "백", "허"
    };

    private final String[] first_names_less_one_percent = new String[] {
        "남", "심", "노", "정", "하", "곽", "성", "차", "주", "우", "구", "신", "임", "전", "민",
        "유", "류", "나", "진", "지", "엄", "채", "원"
    };

    private final String[] last_names = new String[] {
            "서준", "지우", "지안", "서윤", "하준", "도윤", "민준", "하윤", "주원", "시우", "서연", "예준",
            "지호", "연우", "서진", "지유", "하은", "시윤", "서우", "수아", "민서", "은우", "지아", "지후",
            "서현", "준우", "지원", "하린", "서아", "윤서", "유준", "하율", "선우", "수현", "채원", "다은",
            "도현", "지율", "소율", "우진", "지민", "다온", "지윤", "준서", "건우", "현우", "시현", "예린",
            "소윤", "은서", "서율", "시아", "윤우", "지훈", "유나", "이안", "시온", "수빈", "시은", "주아",
            "아린", "아인", "예은", "유주", "서하", "유진", "윤아", "정우", "예나", "이준", "수호", "민재",
            "채은", "하진", "예원", "서은", "연서", "아윤", "현서", "승우", "다인", "유찬", "채아", "예서",
            "현준", "채윤", "시원", "나은", "지환", "수민", "라온", "승현", "하연", "지한", "하람", "재윤",
            "하랑", "유하", "사랑", "유빈", "가온", "가은", "진우", "다현", "소은", "시연", "주하", "수연",
            "나윤", "시후", "하민", "이현", "다연", "다윤", "우빈", "세아", "재이", "하늘", "태윤", "예진",
            "승민", "한결", "소민", "서영", "우주", "은호", "하온", "도연", "예지", "민지", "지온", "민성",
            "주안", "준영", "윤호", "준혁", "윤재", "로운", "시율", "시안", "준희", "지오", "재원", "서원",
            "민우", "정원", "나연", "은성", "민찬", "지수", "승아", "태양", "은찬", "온유", "시완", "민아",
            "채린", "하영", "민호", "은채", "예빈", "지은", "서희", "재민", "리아", "예성", "지완", "도하",
            "설아", "도경", "세연", "라희", "세은", "이든", "지현", "정민", "지성", "채민", "아현", "소이",
            "윤하", "민채", "민규", "리안", "서후", "태민", "아영", "재인", "도율", "재현", "가윤", "유안",
            "규민", "주호", "윤슬", "연아", "소연", "윤지", "윤성", "유정", "승준", "다원", "유민", "은유",
            "다율", "재희", "하나", "서빈", "다솜", "한별", "민주", "주은", "도훈", "성준", "준수", "준호",
            "도영", "혜원", "재하", "태희", "나현", "태준", "다빈", "로아", "태현", "은솔", "보민", "민혁",
            "예찬", "태린", "도원", "성현", "성민", "시훈", "소현", "루아", "강민", "은율", "은재", "세현",
            "정현", "성빈", "규리", "태연", "우현", "라엘", "예슬", "지효", "도준", "민하", "은수", "승호",
            "연재", "주환", "채이", "규빈", "다희", "라윤", "시호", "승원", "채연", "태율", "승윤", "정후",
            "나율", "소희", "동현", "단우", "하엘", "재준", "유현", "예림", "지연", "승빈", "소미", "해솔",
            "하루", "태은", "연준", "해인", "예담", "승연", "수인", "하빈", "제이", "유건", "정윤", "서인",
            "세인", "수진", "도겸", "아라", "동하", "예주", "태리", "예솔", "주영", "주완", "리원", "서호",
            "아진", "도은", "유리", "민석", "태오", "선율", "세준", "태이", "고은", "로이", "지운", "가빈",
            "슬아", "원준", "찬영", "현진", "주현", "효주", "보미", "민건", "호준", "준성", "태인", "현아",
            "준후", "지혁", "윤찬", "가현", "현수", "태경", "가람", "주연", "범준", "로하", "단아", "은별",
            "이솔", "민정", "건희", "주한", "이수", "수지", "가연", "도희", "진서", "승재", "수혁", "도진",
            "시헌", "유림", "세빈", "가을", "연호", "이서", "윤후", "유이", "우성", "채율", "혜린", "유라",
            "경민", "나경", "연수", "은지", "승후", "하리", "채빈", "현민", "성윤", "유은", "현지", "시하",
            "재아", "찬희", "민수", "우리", "해나", "우찬", "동현", "민기", "현승", "민경", "이한", "은준",
            "정연", "제인", "정훈", "찬우", "태하", "유담", "채현", "현성", "아연", "서안", "태영", "우준",
            "하음", "강우", "한나", "소담", "소원", "민솔", "이나", "다혜", "세윤", "하성", "재훈", "혜인",
            "주혁", "승유", "미소", "은설", "한율", "승찬", "효준", "상윤", "소유", "시영", "도아", "민결",
            "재영", "지용", "라임", "채희", "정빈", "지혜", "리우", "채영", "연후", "여준", "태훈", "영준",
            "세영", "승주", "세린", "예온", "하임", "보경", "우영", "수정", "재우", "태호", "건호", "아준",
            "시언", "예인", "건후", "서린", "노아", "찬율", "재율", "희원", "라율", "선호", "가율", "다민",
            "아율", "아름", "별하", "규현", "신우", "가영", "원우", "다영", "동건", "윤채", "새봄", "윤솔",
            "윤건", "승훈", "지영", "은빈", "선유", "리나", "태우", "인우", "소영", "다경", "동준", "한울",
            "윤주", "한솔", "상현", "지인", "혜성", "건율", "세진", "주희", "서정", "진호", "성우", "연주",
            "재은", "강현", "시준", "현호", "나린", "리하", "연지", "성훈", "수안", "혜리", "동우", "소정",
            "해준", "호진", "규원", "은후", "용준", "여원", "유성", "이레", "호연", "은하", "상우", "은비",
            "루다", "민율", "다정", "윤준", "민영", "동욱", "윤진", "세민", "지웅", "보겸", "다겸", "진혁",
            "세희", "효원", "도담", "라은", "시유", "루리", "여름", "수영", "종현", "혜윤", "환희", "서이",
            "재호", "강준", "재혁", "다예", "윤수", "태건", "로희", "준석", "인서", "현빈", "하늬", "요한",
            "려원", "단비", "효린", "준원", "나영", "영우", "아림", "민승", "찬민", "민후", "도건", "가인",
            "준형", "희찬", "이담", "효은", "형준", "세훈", "성원", "서온", "윤설", "민제", "혜빈", "하원",
            "효민", "하경", "세하", "하정", "혜진", "아란", "준현", "진영", "혜민", "희준", "태성", "리온",
            "서유", "석현", "진아", "누리", "하라", "은혜", "재연", "준범", "수하", "우재", "다솔", "다엘",
            "은결", "이찬", "지예", "찬유", "해성", "승환", "준민", "준하", "연희", "하이", "도빈", "정인",
            "리한", "해원", "우혁", "대현", "예건", "도운", "영민", "나희", "루하", "채하", "은혁", "혜주",
            "현석", "아정", "승하", "해린", "도이", "지섭", "은아", "혜나", "여진", "예리", "담희", "해온",
            "채우", "태원", "도헌", "해윤", "규린", "동훈", "주성", "정호", "태환", "호윤", "건하", "아람",
            "효빈", "지희", "경준", "주빈", "주언", "준기", "유경", "유겸", "주형", "지석", "찬빈", "상민",
            "인아", "진욱", "희성", "희수", "로은", "소예", "승혁", "승헌", "성재", "리호", "선재", "라원",
            "동연", "상준", "하선", "희주", "준휘", "현주", "라현", "한서", "선아", "가희", "재성", "루나",
            "유신", "주찬", "동혁", "성연", "이진", "로건", "재경", "찬혁", "예승", "빛나", "서한", "윤희",
            "인성", "인호", "하담", "아리", "초아", "여울", "지욱", "주헌", "영서", "호영", "민설", "성진",
            "시형", "승희", "태웅", "한준", "한빈", "설하", "예현", "유호", "가원", "하겸", "현규", "세온",
            "수찬", "준이", "보영", "재범", "예안", "효진", "이엘", "명준", "승기", "로빈", "유승", "예람",
            "예윤", "희재", "희윤", "율아", "지헌", "혜림", "세령", "시진", "기현", "아민", "혜준", "예봄",
            "희서", "윤제", "재빈", "정환", "창민", "도형", "나라", "수린", "해리", "경빈", "성하", "성호",
            "여은", "준모", "강희", "대한", "세나", "우림", "동규", "동주", "유한", "현재", "다해", "선후",
            "예하", "재용", "루이", "성은", "승리", "의준", "규림", "찬솔", "선준", "주윤", "태림", "태빈",
            "건영", "유미", "한빛", "우석", "조이", "인준", "나원", "이도", "민희", "소망", "우림", "동규",
            "동주", "유한", "현재", "다해", "선후", "예하", "재용", "루이", "성은", "승리", "의준", "규림",
            "찬솔", "선준", "주윤", "태림", "태빈", "건영", "유미", "한빛", "우석", "조이", "인준", "나원",
            "이도", "민희", "소망", "우솔", "은규", "희진", "유환", "나예", "지나", "선빈", "린아", "아론",
            "승범", "보현", "이은", "도균", "수환", "슬우", "유솔", "우민", "아랑", "나엘", "태겸", "효정",
            "진원", "다미", "안나", "송현", "현정", "제아", "상원", "민유", "기범", "재환", "준상", "가민",
            "예율", "규연", "영재", "재형", "한비", "정안", "주이", "기쁨", "영훈", "강윤", "정아", "해담",
            "규진", "채안", "효재", "동민", "진후", "성율", "시혁", "은진", "예랑", "민겸", "윤정", "채훈",
            "동호", "제니", "태규", "현욱", "성찬", "시운", "진성", "효림", "이랑", "진하", "영광", "영찬",
            "상훈", "제하", "미나", "민욱", "성주", "의진", "예훈", "준환", "해민", "준오", "선민", "승언",
            "채운", "믿음", "영진", "율리", "지언", "어진", "송이", "윤혁", "은영", "이삭", "나온", "리현",
            "민국", "하림", "석준", "예령", "찬호", "민교", "태온", "태유", "민선", "율하", "세원", "서훈",
            "정은", "제나", "재후", "윤오", "찬서", "형우", "율희", "기윤", "리오", "하현", "보윤", "연진",
            "새론", "슬찬", "유아", "설희", "샛별", "세이", "사라", "동휘", "리환", "승규", "세율", "진희",
            "도유", "윤영", "종윤", "지승", "진주", "진유", "해율", "서경", "다훈", "동후", "은석", "미르",
            "제윤", "경원", "설현", "윤빈", "영은", "이환", "도언", "은주", "필립", "건민", "다나", "서주",
            "태주", "해진", "경훈", "세찬", "정혁", "예설", "소을", "루희", "상혁", "재욱", "준용", "지빈",
            "종혁", "대윤", "로한", "선하", "제민", "지음", "근우", "소울", "의찬", "강빈", "종우", "관우",
            "고운", "다올", "다운", "예영", "인영", "이루", "재헌", "이설", "영빈", "혜연", "태헌", "윤석",
            "레아", "인하", "현도", "주혜", "태완", "해찬", "유희", "이재", "혁준", "슬기", "민진", "수오",
            "태서", "채준", "범진"
    };

    public List<String> generateNames(int count) {
        List<String> names = new ArrayList<>();

        for (int i = 0; i < count; i++) {
            String name = generateFullName();
            System.out.println(name);
            names.add(name);
        }

        return names;
    }

    private String generateFullName() {
        return getFirstName() + getLastName();
    }


    private String getFirstName() {
        int ran = (int) (Math.random() * 1000);
        if(ran > 800) {
            return "김";
        } else if(ran > 650) {
            return "이";
        } else if(ran > 570) {
            return "박";
        } else if(ran > 520) {
            return "최";
        } else if(ran > 480) {
            return "정";
        } else if(ran > 380) {
            int num = (int) (Math.random() * 5);
            return first_names_top_ten[num];
        } else if(ran > 240) {
            int num = (int) (Math.random() * first_names_one_percent.length);
            return first_names_one_percent[num];
        } else {
            int num = (int) (Math.random() * first_names_less_one_percent.length);
            return first_names_less_one_percent[num];
        }
    }

    private String getLastName() {
        int ran = (int) (Math.random() * 200000);
        return last_names[ran];
    }
}
